{
  "name": "Braised Beef Short Ribs",
  "source": "Esquire",
  "source_file": "Braised Beef Short Ribs (John Besh).txt",
  "author": "John Besh",
  "description": "Fork-tender braised beef short ribs from the chef and owner of August in New Orleans.",
  "ingredients": [
    "Beef short ribs",
    "Salt and pepper",
    "Zinfandel wine",
    "Sugar",
    "Tomatoes",
    "2 cups beef broth",
    "1 tablespoon minced garlic",
    "3 sprigs fresh thyme, picked off stem",
    "2 bay leaves",
    "3 oz canola oil",
    "1 large onion, diced (2 cups)",
    "2 medium carrots, diced (1/2 cup)",
    "2 stalks celery, diced (1/2 cup)",
    "2 oz dried mushrooms"
  ],
  "instructions": [
    "Season short ribs with salt and pepper - be rather generous. In a mixing bowl, whisk together zinfandel, sugar, tomatoes, beef broth, garlic, thyme, bay leaves, and a pinch of salt.",
    "Pour canola oil into a heavy pot or Dutch oven (at least 5 quarts) and place over high heat. When oil is hot, working in small batches, brown the meat. Turn each piece to brown on all sides before removing from the pot.",
    "When all beef is browned and removed from pot, add onion, carrots, and celery, allowing onion to cook until browned, about 10 minutes, stirring frequently.",
    "Return beef to the pot along with wine mixture. Allow wine to come to a boil before reducing heat, skimming fat from surface.",
    "After simmering for several minutes, add mushrooms. Cover and simmer over very low heat until meat is fork tender and nearly falling off the bone, about 1 1/2 to 2 hours.",
    "Once the beef has cooked, remove from pot and keep warm. Turn up heat and reduce the pot liquids until thickened, about 10 minutes. Season with salt and pepper to taste.",
    "Transfer ribs to four shallow bowls, spooning liquid over top."
  ],
  "notes": [
    "A sturdy pot that conducts heat well has a lot to do with the success of this dish. Get yourself a cast-iron pot."
  ],
  "category": null,
  "tags": ["dinner", "beef", "braised", "comfort food", "french", "rich", "fall", "winter"]
}
