{
  "name": "Brothy Chicken with Ginger and Bok Choy",
  "source": "Bon Appetit",
  "source_file": "Brothy Chicken with Ginger and Bok Choy.txt",
  "servings": "2",
  "ingredients": [
    "2 bone-in, skin-on chicken breasts (about 1 1/2 pounds total)",
    "1 4x4-inch piece kombu, broken into bite-size pieces",
    "1 1-inch piece peeled fresh ginger, crushed, plus more cut into thin matchsticks",
    "8 small dried shiitake mushrooms (about 1/2 cup)",
    "1 teaspoon unseasoned rice vinegar",
    "Kosher salt",
    "1/4 teaspoon dried turmeric or 1 1-inch piece fresh turmeric, peeled and grated",
    "1/4 head of bok choy, stems thinly sliced, leaves torn"
  ],
  "instructions": [
    "Place chicken on cutting board and flip onto skin side to expose rib bones. Using a small sharp knife or kitchen shears, cut a slash alongside the keel bone in the center of breast. Use your fingers to pull the bone out, reserving it, then tease out the long strip of flexible cartilage just below it. Use shears or your fingers to strip off rib bones, reserving bones.",
    "Combine chicken bones, kombu, ginger, mushrooms, vinegar, and 3 cups water in a large saucepan. Bring to a simmer over medium heat and cook, skimming off any foam that rises, until reduced by about a third and broth tastes rich, 15-20 minutes. Discard bones.",
    "Meanwhile, season reserved chicken meat generously with salt and let sit 5 minutes. Fit a steamer basket or insert into saucepan with broth. Transfer chicken to steamer.",
    "Cover and steam over medium-low heat, maintaining a gentle steam and replacing any water that evaporates, until chicken is firm to the touch and just cooked through, 15-18 minutes. Transfer chicken to a cutting board.",
    "Remove steamer insert and discard ginger. Add turmeric and bok choy stems to broth. Let simmer until stems are beginning to soften, about 3 minutes. Stir in bok choy leaves and simmer until wilted, about 2 minutes. Season broth with salt, if needed.",
    "Remove skin from chicken and slice on a diagonal. Divide broth among bowls. Arrange chicken over (the kombu and mushrooms are fine to eat but it's up to you). Top with ginger matchsticks."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "soup", "asian", "healthy", "gluten-free", "quick"]
}
