{
  "name": "Chicken in a Pot with Lemon Orzo",
  "source": "Food & Wine",
  "source_file": "Chicken in a Pot with Lemon Orzo.txt",
  "author": "Nigella Lawson",
  "description": "This simple lemon orzo chicken dinner is one of Nigella Lawson's favorite meals to cook at home.",
  "prep_time": "35 minutes",
  "total_time": "2 hours 15 minutes",
  "servings": "4-6",
  "ingredients": [
    "1 whole chicken (about 3 1/2 pounds)",
    "3 fat garlic cloves",
    "2 medium carrots (about 10 ounces)",
    "1 tablespoon olive oil",
    "2 lemons",
    "2 teaspoons dried tarragon or thyme",
    "5 cups sliced leeks, from 2 medium leeks, white parts only",
    "2 teaspoons flaky sea salt or kosher salt",
    "1/2 teaspoon crushed red pepper flakes (optional)",
    "6 cups cold water",
    "1 1/2 cups orzo pasta",
    "1/3 cup finely chopped Italian parsley, plus more for serving",
    "Freshly grated Parmesan, for serving (optional)"
  ],
  "instructions": [
    "Untruss chicken, if it comes trussed, and remove string. If time allows, let it stand out on a board for 40 minutes. Heat oven to 350°F. Peel garlic cloves. Peel and cut carrots into three lengths across, and then into sticks.",
    "Heat oil in a large heavy Dutch oven with a tightly fitting lid over high heat. Place chicken in hot oil breast side down and sear until skin is richly golden, 3 to 5 minutes. Turn chicken over so breast side is up.",
    "Take Dutch oven off heat and, aiming for the space around the chicken, finely grate in zest from lemons. Grate garlic around chicken, add dried tarragon, and give a quick stir in oil as best you can.",
    "Scatter vegetables around chicken, followed by salt and red pepper flakes (if using). Squeeze in juice from your zested lemons.",
    "Pour in cold water - covering all but the very top of the breast - and put Dutch oven back on high heat to bring to a boil.",
    "Once it's bubbling, cover with lid and carefully transfer to oven. Cook chicken for 1 hour and 15 minutes, then check to make sure chicken is all but cooked through and carrots are soft.",
    "Remove pot from oven and add orzo all around chicken, pushing it under liquid and stirring as best you can manage. Cover pot with lid and return to oven. Cook until orzo is soft and swollen, about 15 minutes.",
    "Remove Dutch oven from oven and let stand, covered, for 15 minutes before serving; orzo will continue to soak up broth as it stands.",
    "Chop parsley. Stir in 1/4 cup, then sprinkle over a little more.",
    "Pull chicken gently apart with a couple of forks, removing any bones and skin that come loose.",
    "Stir chicken and orzo again and ladle into bowls, sprinkling with parsley as you go. Offer Parmesan to grate over if desired."
  ],
  "notes": [
    "For a solo supper version, use a large chicken thigh (bone-in and skin-on) cooked in a small saucepan on the stove with adjusted quantities."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "pasta", "one-pot", "italian", "comfort food", "fall", "winter"]
}
