{
  "name": "Crispy Chicken Thighs with Spring Vegetables",
  "source": "Epicurious",
  "source_file": "Crispy Chicken Thighs with Spring Vegetables.txt",
  "author": "Anna Stockwell",
  "description": "The rich and zesty pan sauce is what makes this simple, seasonal supper something you'll want to eat again and again.",
  "prep_time": "45 minutes",
  "total_time": "45 minutes",
  "servings": "4",
  "ingredients": [
    "8 small bone-in, skin-on chicken thighs (about 3 pounds)",
    "2 teaspoons kosher salt, divided",
    "1 teaspoon freshly ground black pepper, divided",
    "1 pound asparagus, trimmed",
    "1 pound baby new potatoes, halved if larger than 1/2 inch",
    "1 bunch radishes (about 1/2 pound), halved",
    "2 tablespoons plus 2 teaspoons vegetable oil, divided",
    "3 garlic cloves, finely chopped",
    "1 tablespoon anchovy paste, or 6 fillets, finely chopped",
    "1/2 cup (1 stick) cold butter, cut into 1-tablespoon pieces, divided",
    "1/2 cup dry white wine",
    "1 tablespoon fresh lemon juice",
    "1 tablespoon finely chopped parsley, plus more for serving"
  ],
  "instructions": [
    "Preheat oven to 450°F. Using kitchen shears, remove bones from chicken thighs, keeping skin and flesh intact; discard bones. Season chicken all over with 1 teaspoon salt and 1/2 teaspoon pepper.",
    "Toss asparagus, potatoes, radishes, 2 tablespoons oil, and remaining 1 teaspoon salt and 1/2 teaspoon pepper in a large bowl. Transfer everything but the asparagus to a rimmed baking sheet and roast 15 minutes.",
    "Meanwhile, grease another rimmed baking sheet with 1 teaspoon oil. Heat remaining 1 teaspoon oil in a large skillet over medium-high. Working in batches, sear chicken skin side down until skin is crisp and golden brown, 5-7 minutes. Transfer skin side up to prepared sheet.",
    "After all chicken is seared (reserve fat in skillet), transfer baking sheet to oven and roast until chicken is cooked through, 8-10 minutes.",
    "When you open oven to roast chicken, remove baking sheet with vegetables, arrange asparagus over potatoes and radishes, then continue to roast until asparagus is crisp-tender and potatoes and radishes are well browned and tender, 8-10 minutes more.",
    "Meanwhile, carefully pour off excess fat from reserved skillet, leaving browned bits on the bottom. Add garlic, anchovy paste, and 1 tablespoon butter to skillet and cook over medium heat until garlic is softened and fragrant, about 1 minute.",
    "Add wine, scraping up browned bits with a spatula, and continue to cook, stirring, until reduced by half, about 2 minutes. Remove pan from heat and stir in lemon juice.",
    "Add remaining butter one piece at a time, swirling and stirring after each addition to fully emulsify sauce. Stir in 1 tablespoon parsley.",
    "Transfer chicken and vegetables to a platter, then pour sauce over. Top with more parsley before serving."
  ],
  "notes": [
    "You can keep the bones in your chicken thighs if you prefer - roast in oven 12-14 minutes instead of 8-10."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "roast", "skillet", "spring", "fresh"]
}
