{
  "name": "Garlic Shrimp with Cilantro Spaghetti Squash",
  "source": "EatingWell",
  "source_file": "Garlic Shrimp with Cilantro Spaghetti Squash.txt",
  "description": "Garlicky shrimp are served on top of buttery, cilantro-flecked spaghetti squash in this quick, healthy dinner recipe inspired by shrimp scampi. Pair with a side of sauteed greens.",
  "total_time": "25 minutes",
  "servings": "4",
  "ingredients": [
    "1 (2 1/2- to 3-pound) spaghetti squash, halved lengthwise and seeded",
    "2 tablespoons extra-virgin olive oil",
    "1 tablespoon minced garlic",
    "1 teaspoon ground coriander",
    "1 teaspoon ground cumin",
    "1/2 teaspoon salt, divided",
    "1/4 teaspoon cayenne pepper",
    "1/2 cup dry white wine, such as pinot grigio",
    "1 pound peeled and deveined raw shrimp (16-20 per pound)",
    "1 tablespoon lemon juice",
    "1/4 cup chopped fresh cilantro",
    "2 tablespoons unsalted butter, melted",
    "1/4 teaspoon ground pepper",
    "Lemon wedges for serving"
  ],
  "instructions": [
    "Place squash cut-side down in a microwave-safe dish; add 2 tablespoons water. Microwave, uncovered, on High until the flesh is tender, about 10 minutes. (Alternatively, place squash halves cut-side down on a rimmed baking sheet and bake at 400°F until tender, 40 to 50 minutes.)",
    "Meanwhile, heat oil in a large skillet over medium-high heat. Add garlic, coriander, cumin, 1/4 teaspoon salt and cayenne; cook, stirring, for 30 seconds. Add wine and bring to a simmer.",
    "Add shrimp and cook, stirring, until the shrimp are pink and just cooked through, 3 to 4 minutes. Remove from heat and stir in lemon juice.",
    "Use a fork to scrape the squash from the shells into a medium bowl. Add cilantro, butter, pepper and the remaining 1/4 teaspoon salt; stir to combine.",
    "Serve the shrimp over the spaghetti squash with a lemon wedge on the side."
  ],
  "notes": [
    "Oven method: Instead of microwaving, place squash halves cut-side down on a rimmed baking sheet and bake at 400°F until tender, 40 to 50 minutes."
  ],
  "category": null,
  "tags": ["dinner", "seafood", "shrimp", "healthy", "low-carb", "gluten-free", "quick"]
}
