{
  "name": "Grilled Chicken Thigh and Cucumber Salad",
  "source": "Food & Wine",
  "source_file": "Grilled Chicken Thigh and Cucumber Salad Recipes - Michael Symon.txt",
  "author": "Michael Symon",
  "description": "\"I'm a thigh guy,\" says chef Michael Symon. \"It has the deepest flavor of all chicken cuts.\"",
  "total_time": "30 minutes",
  "servings": "4",
  "ingredients": [
    "6 skin-on, boneless chicken thighs (2 pounds), pounded 1/2 inch thick",
    "1/4 cup plus 2 tablespoons extra-virgin olive oil",
    "Kosher salt",
    "Pepper",
    "3 tablespoons red wine vinegar",
    "1 tablespoon minced shallot",
    "1 teaspoon minced garlic",
    "1 English cucumber, thinly sliced",
    "1/4 cup thinly sliced red onion",
    "1 small Fresno or red jalapeno chile, thinly sliced",
    "2 tablespoons chopped mint, plus whole leaves for garnish",
    "3 tablespoons chopped roasted unsalted almonds"
  ],
  "instructions": [
    "Light a grill. Rub the chicken thighs with 2 tablespoons of the olive oil and season with salt and pepper.",
    "Arrange the chicken skin side down on the grill and top with a sheet of foil and a weighted heavy baking sheet. Grill the chicken over moderate heat until the skin is golden brown, about 5 minutes.",
    "Turn the chicken skin side up, top with the foil and weighted baking sheet and grill for 3 minutes longer. Remove the baking sheet.",
    "Turn the chicken skin side down once more and grill until the skin is crispy and the chicken is cooked through, about 2 minutes longer. Transfer the chicken to plates.",
    "Meanwhile, in a large bowl, combine the vinegar with the shallot and garlic and gradually whisk in the remaining 1/4 cup of olive oil until well blended.",
    "Add the cucumber, onion, chile and chopped mint and season with salt and pepper. Toss to coat.",
    "Slice the chicken; toss with the cucumber salad. Garnish with the nuts and mint leaves."
  ],
  "notes": [
    "Suggested pairing: a juicy, ripe apple-scented Spanish white wine."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "salad", "grilled", "healthy", "quick", "summer", "fresh"]
}
