{
  "name": "Herbes de Provence Skillet Chicken with Potatoes and Greens",
  "source_file": "Herbes de Provence Skillet Chicken with Potatoes and Greens.txt",
  "description": "Herb-marinated chicken cooked in a skillet with potatoes, Swiss chard, and olives. Perfect for meal prep - can be frozen ahead.",
  "prep_time": "15 minutes",
  "cook_time": "35 minutes",
  "total_time": "2 hours 50 minutes (including marinating)",
  "servings": "4-6",
  "ingredient_groups": {
    "Marinade": [
      "1 1/2 pounds boneless skinless chicken tenders or thinly sliced chicken breasts",
      "1 1/2 tablespoons herbes de Provence",
      "1 1/4 teaspoons kosher salt",
      "1 teaspoon freshly ground pepper",
      "Zest of one lemon",
      "1 1/2 tablespoons lemon juice",
      "3 cloves minced garlic",
      "2 tablespoons olive oil"
    ],
    "Vegetables": [
      "2 teaspoons olive oil",
      "3 tablespoons butter, divided",
      "1 1/2 pounds B-sized or baby potatoes",
      "1/2 yellow onion",
      "1/2 teaspoon kosher salt",
      "Freshly ground pepper",
      "2 handfuls (2 packed cups) Swiss chard or spinach",
      "1/3 cup halved pimento-stuffed Spanish olives",
      "1 teaspoon red wine vinegar"
    ]
  },
  "ingredients": [
    "1 1/2 pounds boneless skinless chicken tenders",
    "1 1/2 tablespoons herbes de Provence",
    "1 1/4 teaspoons kosher salt",
    "1 teaspoon freshly ground pepper",
    "Zest of one lemon",
    "1 1/2 tablespoons lemon juice",
    "3 cloves minced garlic",
    "2 tablespoons plus 2 teaspoons olive oil",
    "3 tablespoons butter, divided",
    "1 1/2 pounds baby potatoes",
    "1/2 yellow onion",
    "2 cups Swiss chard or spinach",
    "1/3 cup halved pimento-stuffed Spanish olives",
    "1 teaspoon red wine vinegar"
  ],
  "instructions": [
    "Combine the chicken, herbes de Provence, salt, pepper, lemon zest, lemon juice, garlic and olive oil in a gallon-sized zip-top bag. Remove air and seal. Marinate in the fridge for a couple of hours or up to two days.",
    "Prepare the vegetables: If the potatoes are larger than a golf ball, quarter them; if smaller, just halve them. Slice the onion. Wash the Swiss chard, remove stems and chop them, then cut leaves into strips about an inch thick. Cut the olives in half.",
    "Cook the chicken: Set a large skillet over medium heat, add 2 teaspoons olive oil and 1 tablespoon butter. Once the oil shimmers and butter melts, add the chicken and any marinade. If any chicken is folded up, unfold it so it lays flat. Cook for 2 minutes, then flip.",
    "Add the potatoes, onion, and 1/4 cup water to the pan with the chicken. Cover with a lid. Let everything simmer together for about 10 minutes.",
    "Remove the chicken to a plate and tent with foil. Add the remaining 2 tablespoons of butter, 1/4 teaspoon of salt and pepper to the skillet. Stir the potatoes, cover and cook for another 10 minutes.",
    "Turn the heat up to medium-high to reduce the liquid and finish cooking the potatoes uncovered, 2 to 3 minutes.",
    "When you can easily pierce the potatoes with a fork, add the chard leaves and chopped stems, olives, and red wine vinegar. Toss gently until the greens are just wilted.",
    "Nestle the chicken back into the pan. Bring the whole thing to the table and serve."
  ],
  "notes": [
    "This recipe can be prepped in a freezer bag and frozen for up to 6 months. Thaw in the fridge during the day before cooking."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "skillet", "french", "one-pot", "make-ahead", "meal prep"]
}
