{
  "name": "Honey-Garlic Chicken Thighs with Carrots and Broccoli",
  "source": "EatingWell",
  "source_file": "Honey-Garlic Chicken Thighs with Carrots and Broccoli.txt",
  "author": "Sarah Epperson",
  "description": "Sweet and savory baked honey-garlic chicken thighs come with a side of veggies that cook on the same sheet pan. The honey-soy-garlic marinade does double duty as an irresistible sauce to drizzle over everything.",
  "ingredients": [
    "1/2 cup honey",
    "1 1/2 tablespoons reduced-sodium soy sauce or tamari",
    "4 cloves garlic, minced (about 1 1/2 tablespoons)",
    "1 tablespoon cider vinegar",
    "1/4 teaspoon crushed red pepper",
    "8 (5-ounce) bone-in, skin-on chicken thighs",
    "1 pound small carrots, sliced into 1/2-inch pieces",
    "2 tablespoons olive oil, divided",
    "4 cups broccoli florets (about 1 pound)",
    "1/2 teaspoon salt",
    "1/2 teaspoon ground pepper",
    "1 teaspoon cornstarch",
    "1 teaspoon water"
  ],
  "instructions": [
    "Whisk honey, soy sauce (or tamari), garlic, vinegar and crushed red pepper in a small bowl. Place chicken and half of the honey mixture (about 1/4 cup) in a zip-top plastic bag; remove excess air and seal. Massage the chicken until well coated. Refrigerate for at least 30 minutes and up to 2 hours. Reserve the remaining honey mixture.",
    "Preheat oven to 400°F. Line a large rimmed baking sheet with foil; coat with cooking spray. Remove the chicken from the marinade (discard marinade); arrange on one side of the prepared pan.",
    "Combine carrots and 1 tablespoon oil in a medium bowl; toss well to coat. Spread the carrots in an even layer on the other side of the pan. Bake the chicken and carrots for 15 minutes. Remove from the oven; stir the carrots.",
    "Combine broccoli and the remaining 1 tablespoon oil; toss well to coat. Distribute the broccoli evenly over the chicken and carrots on the pan. Sprinkle salt and pepper over all. Bake until the vegetables are tender and a thermometer inserted in the thickest portion of the chicken registers 165°F, 15 to 18 minutes.",
    "Meanwhile, whisk cornstarch and water in a small bowl until no clumps remain. Combine the cornstarch mixture and the reserved honey mixture in a small saucepan; bring to a simmer over medium-low heat, whisking once or twice. Simmer, whisking often, until the sauce is clear and thickened, about 2 minutes. Drizzle over the chicken and vegetables. Serve hot."
  ],
  "notes": [
    "To make ahead: Refrigerate in an airtight container for up to 4 days."
  ],
  "nutrition": {
    "calories": "475",
    "protein": "35.8g",
    "carbohydrates": "39.7g",
    "fiber": "5.1g",
    "fat": "20.1g",
    "cholesterol": "115.2mg",
    "sodium": "686mg"
  },
  "category": null,
  "tags": ["dinner", "chicken", "roast", "healthy", "asian", "one-pot"]
}
