{
  "name": "Italian Chicken and Vegetable Skillet",
  "source_file": "Italian Chicken and Vegetable Skillet.txt",
  "author": "Danae Halliday",
  "description": "This easy, family friendly, Italian Chicken and Vegetable Skillet is full of fresh vegetables, plenty of protein, and lots of flavor!",
  "prep_time": "15 minutes",
  "cook_time": "15 minutes",
  "total_time": "45 minutes",
  "servings": "4",
  "ingredients": [
    "1-2 tablespoons olive oil",
    "1 pound boneless skinless chicken breasts, cut into bite sized pieces",
    "2 tablespoons pesto",
    "2 teaspoons Italian seasoning, divided",
    "1/2 teaspoon red pepper flakes (optional)",
    "2 teaspoons grated or minced garlic",
    "1 cup cherry tomatoes, halved",
    "2 small zucchini, diced",
    "1 cup cannellini beans, rinsed and drained",
    "1 tablespoon balsamic vinegar",
    "1 tablespoon chopped fresh basil",
    "Salt and freshly ground black pepper to taste",
    "1/2 cup shredded mozzarella cheese"
  ],
  "instructions": [
    "Season the cut up pieces of chicken with salt and pepper and put them in a freezer bag with the pesto, garlic, one teaspoon of Italian seasoning, and red pepper flakes. Massage the mixture into the chicken and let it marinate for at least 15 minutes or overnight.",
    "Heat a large skillet over medium-high heat and add in a tablespoon of olive oil. Add the chicken to the skillet and sauté until cooked through. Remove the cooked chicken onto a plate.",
    "Add additional oil to the skillet and then add in the zucchini, tomatoes, salt and pepper, and the remaining teaspoon of Italian seasoning. Sauté until they start to soften, about 3 minutes.",
    "Lower the heat to medium and add the chicken back into the skillet along with the cannellini beans, balsamic vinegar and basil. Stir everything together and taste for seasoning.",
    "Top with the shredded mozzarella and cover with a lid until the cheese melts. Serve immediately."
  ],
  "nutrition": {
    "calories": "347",
    "carbohydrates": "20g",
    "protein": "47g",
    "fat": "9g",
    "saturated_fat": "2g",
    "cholesterol": "101mg",
    "sodium": "457mg",
    "fiber": "5g",
    "sugar": "3g"
  },
  "category": null,
  "tags": ["dinner", "chicken", "italian", "skillet", "healthy", "quick", "one-pot"]
}
