{
  "name": "Lazy Chicken-and-Sausage Cassoulet",
  "source": "Food & Wine",
  "source_file": "Lazy Chicken-and-Sausage Cassoulet.txt",
  "author": "Molly Stevens",
  "description": "A simplified cassoulet that can be made in under an hour. Boneless chicken thighs, smoked sausage, and white beans baked under a crunchy breadcrumb crust.",
  "prep_time": "35 minutes",
  "total_time": "1 hour",
  "servings": "4-6",
  "ingredients": [
    "2 pounds boneless, skinless chicken thighs, patted dry",
    "1 3/4 teaspoons kosher salt, divided",
    "1 teaspoon black pepper, divided",
    "1/2 cup olive oil or canola oil, divided",
    "1 medium-size yellow onion, chopped",
    "6 ounces smoked sausage, such as kielbasa, halved lengthwise and cut crosswise into 1/2-inch pieces",
    "3 garlic cloves, minced",
    "1 tablespoon chopped fresh thyme, plus more for garnish",
    "1/8 teaspoon ground allspice",
    "1/4 cup dry white wine",
    "2 tablespoons tomato paste",
    "2 (15-ounce) cans white beans, such as Great Northern or cannellini, drained and rinsed",
    "1 cup unsalted chicken stock",
    "1 1/2 cups fresh breadcrumbs"
  ],
  "instructions": [
    "Preheat oven to 375°F. Season chicken thighs with 1 teaspoon salt and 1/2 teaspoon pepper. Heat 2 tablespoons oil in a large skillet over medium-high. Add chicken thighs, smooth side down. Cook, undisturbed, adjusting heat as necessary so thighs cook evenly without scorching, until edges turn opaque and bottoms are nicely browned, about 6 minutes. Flip and cook until internal temperature reaches 165°F, 4 to 5 minutes. Set aside on a plate. Do not wipe skillet clean.",
    "Return skillet and any drippings to medium heat. Add 1 tablespoon oil, onion, and sausage. Cook, stirring often, until onion is tender and light golden, about 6 minutes. Add garlic, thyme, allspice, remaining 3/4 teaspoon salt, and remaining 1/2 teaspoon pepper. Cook, stirring often, until heated through and fragrant, about 2 minutes. Add wine and tomato paste, and stir to combine. Bring to a simmer; cook, stirring often, 1 to 2 minutes. Add beans, stock, and 2 tablespoons oil; bring to a simmer.",
    "Shred chicken into bite-size pieces; add to onion mixture along with any drippings that have accumulated on the plate. Transfer to an 8- x 11-inch baking dish. Spread into an even layer. Toss breadcrumbs with remaining 3 tablespoons oil in a large bowl. Scatter breadcrumbs over bean mixture.",
    "Bake in preheated oven until heated through, top is browned, and sides are bubbly, about 20 minutes. (If baking from refrigerated, bake an additional 5 to 10 additional minutes.)"
  ],
  "notes": [
    "Make Ahead: The dish may be prepared through step 3, covered, and stored in refrigerator up to 1 day ahead."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "french", "casserole", "comfort food", "make-ahead", "one-pot"]
}
