{
  "name": "No-Bake Chocolate Peanut Butter Bars",
  "source": "Sally's Baking Addiction",
  "source_file": "No-Bake Chocolate Peanut Butter Bars.txt",
  "description": "These no-bake chocolate peanut butter bars are incredibly decadent and made from only 5 ingredients.",
  "prep_time": "10 minutes",
  "cook_time": "0 minutes",
  "total_time": "2 hours 10 minutes",
  "servings": "20-24 squares",
  "ingredients": [
    "1/2 cup (115g) salted butter, melted",
    "1 cup (85g) graham cracker crumbs (about 8 full sheet graham crackers)",
    "2 cups (240g) confectioners' sugar",
    "1 cup + 2 tablespoons (280g) creamy peanut butter, divided",
    "1 cup (180g) semi-sweet chocolate chips"
  ],
  "instructions": [
    "Line an 8×8 or 9×9 inch square baking pan with aluminum foil or parchment paper. Set aside.",
    "Mix the melted butter, graham cracker crumbs, and confectioners' sugar together in a medium bowl. Stir in 1 cup (250g) of peanut butter, then press evenly into prepared baking pan.",
    "Melt remaining 2 tablespoons of peanut butter with the chocolate chips in the microwave or on the stove. Stir until smooth. Spread over peanut butter layer.",
    "Chill in the refrigerator until completely firm, at least 2 hours. Allow to sit at room temperature for 10 minutes before cutting. Serve chilled. Setting them out for a few hours at room temperature for serving is OK.",
    "Cover leftover bars tightly and refrigerate for up to 1 week."
  ],
  "notes": [
    "Freezing Instructions: Cover bars tightly, as a whole or cut into individual squares, and freeze for up to 3 months. Line the squares in a freezer-friendly container between sheets of parchment paper. Thaw overnight in the refrigerator before serving.",
    "Butter: Unsalted butter can be used instead. Add 1/4 teaspoon salt with the peanut butter in step 2.",
    "Peanut Butter: For best texture, use a processed creamy peanut butter such as Jif or Skippy. Do not recommend oily or natural style peanut butter for this recipe."
  ],
  "category": null,
  "tags": ["dessert", "no-bake", "chocolate", "peanut butter", "sweet", "american", "easy"]
}
