{
  "name": "One-Pan Chicken and Asparagus Bake",
  "source": "EatingWell",
  "source_file": "One-Pan Chicken and Asparagus Bake.txt",
  "author": "Karen Rankin",
  "description": "In this chicken and asparagus recipe, we use one baking sheet to whip up dinner quickly, veggies included. Pounding the chicken thin helps it cook quickly alongside the carrots and potatoes, with asparagus rounding out the meal.",
  "ingredients": [
    "2 (8 ounce) boneless, skinless chicken breasts, cut in half crosswise",
    "12 ounces baby Yukon Gold potatoes, halved lengthwise",
    "8 ounces carrots, diagonally sliced into 1-inch pieces",
    "3 tablespoons extra-virgin olive oil, divided",
    "2 teaspoons ground coriander, divided",
    "3/4 teaspoon salt, divided",
    "1/2 teaspoon ground pepper, divided",
    "2 tablespoons lemon juice",
    "2 tablespoons chopped shallot",
    "1 tablespoon whole-grain Dijon mustard",
    "2 teaspoons honey",
    "1 bunch asparagus",
    "Fresh parsley and dill for garnish",
    "Lemon wedges for serving"
  ],
  "instructions": [
    "Preheat oven to 375 degrees F. Place chicken on a clean work surface and cover with plastic wrap. Using a meat mallet, pound the chicken pieces to an even 1/2-inch thickness. Arrange on one half of a large rimmed baking sheet. Arrange potatoes and carrots in a single layer on the other half of the pan. Drizzle the chicken and vegetables with 1 tablespoon oil; sprinkle with 1 teaspoon coriander, 1/2 teaspoon salt and 1/4 teaspoon pepper. Bake for 15 minutes.",
    "Meanwhile, whisk lemon juice, shallot, mustard, honey and the remaining 2 tablespoons oil, 1 teaspoon coriander, 1/4 teaspoon salt and 1/4 teaspoon pepper in a small bowl.",
    "Remove the pan from the oven; switch the oven to broil. Stir the potato-carrot mixture; arrange asparagus in the center of the pan. Spoon the lemon juice-shallot mixture evenly over the chicken and vegetables. Broil until the chicken and vegetables are lightly browned, asparagus is tender-crisp and a thermometer inserted in the thickest portion of the chicken registers 165 degrees F, about 10 minutes. Remove from oven; sprinkle evenly with parsley and dill. Serve with lemon wedges."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "healthy", "one-pot", "sheet pan", "quick", "spring"]
}
