{
  "name": "Pappardelle with White Bolognese",
  "source_file": "Pappardelle with White Bolognese.txt",
  "author": "Andrew Carmellini",
  "description": "A creamy white Bolognese sauce made with ground veal and pork, half and half, and a soffritto of bacon, onion, mushrooms, and celery root, served over pappardelle.",
  "prep_time": "30 minutes",
  "cook_time": "3 hours",
  "servings": "2+",
  "ingredients": [
    "3 tablespoons extra virgin olive oil",
    "1 lb ground veal, pork or beef",
    "1/2 cup dry white wine",
    "1 1/4 cup half & half",
    "1 cup chicken stock",
    "1 thyme sprig",
    "1 small rosemary sprig",
    "2 sage leaves",
    "1 bay leaf",
    "1 small garlic clove, minced",
    "1/4 tsp pink peppercorns",
    "Pinch crushed red pepper",
    "Pinch freshly grated nutmeg",
    "Kosher salt and fresh ground pepper",
    "1/4 cup finely chopped bacon",
    "1 cup finely chopped onion",
    "1/4 cup finely chopped white or cremini mushrooms",
    "1/4 cup finely chopped peeled celery root",
    "1/2 lb pappardelle",
    "Freshly grated Parmigiano cheese for serving"
  ],
  "instructions": [
    "In a large enamelled cast-iron casserole, heat olive oil until shimmering. Add veal and pork and cook over moderately high heat, stirring occasionally, until most of the liquid has evaporated and the meat is nearly cooked throughout, 6-8 minutes. Add wine and cook over moderate heat, scraping any browned bits, about 3 minutes.",
    "Add half & half and chicken stock to casserole, stir in thyme, rosemary and sage, bay leaf, pink pepper, crushed red pepper, nutmeg and generous pinch of salt and pepper. Bring just to a simmer. Cover and cook over low heat, stirring occasionally, until sauce thickens and meat is tender, 2 hours.",
    "In a medium skillet, cook bacon over moderate heat, stirring until fat has rendered, 5 minutes. Add onion, mushrooms, and celery root, stir until softened. Stir soffritto into Bolognese sauce, cover partially and cook over moderately low heat, stirring occasionally, until sauce reduces slightly, 25 minutes.",
    "Discard the thyme, rosemary and bay leaf. Season the Bolognese sauce with salt and pepper and keep warm over very low heat.",
    "In a large pot of salted boiling water, cook the pappardelle until al dente. Drain, reserving 1/4 cup of the cooking water. Add the pasta and cooking water to the Bolognese sauce and toss over moderate heat until the pasta is well coated, 2 minutes. Transfer pasta to a large, shallow bowl and serve right away, passing freshly grated Parmigiano-Reggiano at the table."
  ],
  "category": null,
  "tags": ["dinner", "pasta", "italian", "comfort food", "beef", "pork"]
}
