{
  "name": "Philly Cheesesteak Queso",
  "source": "Food & Wine",
  "source_file": "Philly Cheesesteak Queso Recipe - Justin Chapple.txt",
  "author": "Justin Chapple",
  "description": "A crowd-pleasing dip combining Tex-Mex queso and Philly Cheesesteak. Provolone and white American cheeses form a gooey base for sauteed peppers, onions and thinly sliced rib-eye steak.",
  "prep_time": "30 minutes",
  "total_time": "45 minutes",
  "servings": "8",
  "ingredients": [
    "3 tablespoons canola oil",
    "1 small red bell pepper, stemmed, seeded and thinly sliced",
    "1 small green bell pepper, stemmed, seeded and thinly sliced",
    "1 small sweet onion, halved lengthwise and thinly sliced",
    "Kosher salt",
    "Pepper",
    "One 12-ounce rib-eye steak, frozen for 30 minutes and very thinly sliced",
    "1 cup half-and-half",
    "1 pound white American cheese, coarsely shredded (4 cups)",
    "1/2 pound provolone cheese, coarsely shredded (2 cups)",
    "2 hoagie rolls, sliced crosswise and lightly toasted"
  ],
  "instructions": [
    "In a large cast-iron skillet, heat 2 tablespoons of the canola oil. Add the bell peppers and onion and season with salt and pepper. Cook over moderately high heat, stirring occasionally, until softened and browned in spots, about 8 minutes. Transfer the pepper mixture to a small bowl.",
    "Wipe out the skillet and heat the remaining 1 tablespoon of canola oil in it. Season the steak with salt and pepper. Add the steak and cook over high heat, stirring occasionally, until browned and just cooked through, about 3 minutes. Transfer the steak to a small bowl.",
    "Wipe out the skillet, add the half-and-half and bring just to a simmer over moderate heat. Whisk in both cheeses in small handfuls until completely melted and the queso is very smooth, about 5 minutes. Top the queso with the steak and pepper mixture. Keep warm over very low heat and serve immediately with the toasted hoagie roll slices."
  ],
  "notes": [
    "Freezing the steak for 30 minutes makes it easier to slice very thinly.",
    "Tortilla chips can be served instead of hoagie rolls."
  ],
  "category": null,
  "tags": ["appetizer", "dip", "beef", "american", "party food", "cheese"]
}
