{
  "name": "Roast Chicken Breasts with Tarragon and Mustard Sauce",
  "source": "The View from Great Island",
  "source_file": "Roast Chicken Breasts with Tarragon and Mustard Sauce.txt",
  "author": "Sue Moran",
  "description": "A classy, easy, and comforting everyday meal redolent with the flavors of the Mediterranean.",
  "prep_time": "15 minutes",
  "cook_time": "30 minutes",
  "total_time": "45 minutes",
  "servings": "2",
  "ingredients": [
    "2 boneless chicken breasts, skin on",
    "Olive oil",
    "Salt and fresh pepper",
    "2 baby Vidalia onions, sliced (or 1 leek, or 2 large shallots)",
    "Splash of Marsala, white wine, vermouth or dry sherry",
    "Juice of 1/2 lemon",
    "Handful of fresh chopped tarragon leaves",
    "1/2 cup cream",
    "1 tablespoon stone ground or Dijon mustard"
  ],
  "instructions": [
    "Set the oven to 400F.",
    "Rub the chicken breasts with olive oil and season well with salt and fresh pepper. Rub the oil and spices in to the meat.",
    "Drizzle a little olive oil in a pan over medium high heat. When the pan is hot, put the chicken breasts in, skin side down. Sear for a couple of minutes until the skin has good color.",
    "Remove the chicken to a baking pan that has also been drizzled with olive oil, skin side up. Cook at 400 for 20 to 30 minutes or until done. The time will depend on how large your chicken breasts are (your thermometer should read 165F.) Finish under the broiler if you want more color or crispness to the skin. Set aside to rest under foil. Reserve any juices from the cooking to add to the sauce later.",
    "In the same pan you seared the chicken in, add the onions and saute over medium low heat for several minutes until they soften. Do not brown them.",
    "Give the pan a splash of wine and squeeze in the lemon juice. Let reduce on medium high for a minute.",
    "Add the tarragon, the cream, the mustard, and any leftover juices from the cooked chicken. Bring to a simmer. Cook for a minute or two. Taste and adjust the seasonings if necessary. Pour onto a serving platter or shallow casserole dish.",
    "Slice the chicken and nestle into the sauce. Sprinkle with a little more fresh tarragon."
  ],
  "notes": [
    "Don't try to substitute milk for the cream, because the lemon and wine will curdle it.",
    "The sauce would also be great with haddock, cod, or tilapia."
  ],
  "nutrition": {
    "calories": "498",
    "carbohydrates": "7g",
    "protein": "50g",
    "fat": "28g",
    "saturated_fat": "15g",
    "cholesterol": "226mg",
    "sodium": "374mg",
    "fiber": "1g",
    "sugar": "2g"
  },
  "category": null,
  "tags": ["dinner", "chicken", "french", "mediterranean", "creamy", "elegant"]
}
