{
  "name": "Rosy Chicken",
  "source": "Food52",
  "source_file": "Rosy Chicken.txt",
  "author": "Merrill Stubbs",
  "description": "Chicken legs braised in rose wine with tomatoes, garlic, thyme, and chili flakes.",
  "servings": "4",
  "ingredients": [
    "4 whole chicken legs, about 2 pounds total",
    "Salt",
    "3 tablespoons olive oil",
    "3 garlic cloves, crushed",
    "2/3 cups dry rose",
    "1 large tomato, chopped",
    "2 sprigs thyme",
    "1/4 teaspoon red chili flakes",
    "1 cup grape or cherry tomatoes",
    "Freshly ground black pepper"
  ],
  "instructions": [
    "Rinse the chicken legs and pat them dry. Season liberally on all sides with salt. Heat the olive oil in large, heavy saute pan with high sides over medium-high heat. Brown the chicken legs on both sides, about 3 minutes per side. Transfer the chicken legs to a plate and set aside.",
    "Turn the heat down to medium-low and add the garlic. Cook, stirring frequently, until you can smell the garlic, about a minute. (Do not allow the garlic to burn.) Add the rose and turn the heat up so that it simmers. Reduce the wine by about half, scraping up the brown bits from the bottom of the pan with a wooden spoon as they loosen. Stir in the chopped tomato, the thyme and the chili flakes and cook for another few minutes, until the tomato starts to release its juices.",
    "Return the chicken legs to the pan (skin side up) and add the grape tomatoes, tucking them around the chicken legs. Grind some black pepper over all. Partially cover the pan and turn down the heat so that the sauce is simmering gently. Cook for 30 to 40 minutes, until the chicken legs are tender, and the meat has started to pull away from the bone.",
    "If the sauce is thin, transfer the chicken legs to a clean plate and turn up the heat for a few minutes so that the sauce boils and thickens a bit. Don't let it cook down too much, as you'll want plenty to pour over the rice or mashed potatoes that you'll be serving!",
    "Return the chicken to the sauce and heat through before serving with rice, mashed potatoes or crusty bread."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "braised", "french", "wine", "tomatoes"]
}
