{
  "name": "Skillet Chicken with Corn and Miso Butter",
  "source": "Food52",
  "source_file": "Skillet Chicken with Corn and Miso Butter.txt",
  "author": "EmilyC",
  "description": "Simple, boldly flavored chicken cooked entirely on the stovetop in one skillet. The miso-glazed chicken creates a gorgeous fond that makes the corn crazy good. Cook the chicken slowly over moderate heat for deeply bronzed, sticky, salty-sweet results.",
  "prep_time": "10 minutes",
  "cook_time": "30 minutes",
  "servings": "4",
  "ingredients": [
    "2 tablespoons white miso, separated",
    "3 tablespoons olive oil, separated",
    "1 tablespoon lime juice",
    "1/2 teaspoon honey",
    "Kosher salt, to taste",
    "1 1/2 pounds boneless, skinless chicken thighs or breasts",
    "3/4 cup finely chopped Vidalia onion (from 1 small onion)",
    "3 to 3 1/2 cups corn (from 5 to 6 ears)",
    "1 tablespoon fresh thyme, chopped",
    "1 tablespoon butter, softened",
    "Lime wedges, for serving",
    "A big handful of chopped chives or cilantro, for serving"
  ],
  "instructions": [
    "In a small bowl, stir together 1 tablespoon miso (level, not heaping), 2 tablespoons olive oil, lime juice, and honey until smooth.",
    "Place chicken on a large plate or dish and dry well to promote even browning. Lightly season both sides with kosher salt (keeping in mind that the miso will add saltiness). Spoon the miso rub over the chicken, and using your hands, rub it evenly over both sides of the chicken.",
    "In a 12-inch cast-iron or heavy nonstick skillet, heat 1 tablespoon olive oil over medium heat. Add the chicken thighs to the skillet and cook until nicely browned on the first side, about 10 minutes. (Take your time: you want the miso chicken and fond in the skillet to nicely caramelize, not burn; lower heat if needed.) Flip; continue cooking until browned and cooked through (an internal temperature of 165 degrees F), about 8 to 10 minutes longer. Transfer the thighs to a plate and set aside. Pour off any excess fat, leaving a tablespoon or two in the skillet.",
    "Add onions to the skillet, scraping up the fond with a wooden spoon as they start to cook. (Add a tablespoon of water, if needed, to help deglaze the pan.) Cook the onions until tender, about 5 minutes. They'll be a rich brown from the fond.",
    "Meanwhile, in a small bowl, combine butter and remaining tablespoon of miso. Stir and smash together until well integrated.",
    "Add the corn and thyme to the skillet with the onions; saute until the corn is crisp-tender, stirring several times, about 3 to 4 minutes. Add miso butter, stirring to evenly coat the corn in it as it melts. Cook for another minute, then remove from heat. Squeeze a little lime juice over the corn. Adjust acidity and seasoning, to taste.",
    "Top with chives or cilantro, and serve warm with lime wedges on the side."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "skillet", "summer", "asian", "corn", "one-pot"]
}
