{
  "name": "Skillet Chicken Thighs with Potatoes, Carrots, and Greens",
  "source_file": "Skillet Chicken Thighs with Potatoes, Carrots, and Greens.txt",
  "description": "Bone-in chicken thighs braised with Yukon Gold potatoes, carrots, Swiss chard, and a Dijon-lemon braising liquid.",
  "prep_time": "15 minutes",
  "cook_time": "45 minutes",
  "total_time": "60 minutes",
  "servings": "4-6",
  "ingredients": [
    "8 (about 3 pounds) bone-in, skin-on chicken thighs",
    "1/2 teaspoon kosher salt",
    "1/8 teaspoon freshly ground black pepper",
    "2 tablespoons olive oil",
    "1 1/2 pounds (about 4 medium) Yukon Gold potatoes, cut into 1-inch chunks",
    "12 ounces baby carrots",
    "3 whole, unpeeled cloves garlic, smashed with the flat of a knife to break the skin",
    "1 bunch Swiss chard",
    "1 1/2 cups chicken stock",
    "1 tablespoon Dijon mustard",
    "Finely grated zest of 1 lemon",
    "1/2 teaspoon dried thyme",
    "Juice of 1/2 lemon",
    "1/4 cup chopped parsley"
  ],
  "instructions": [
    "Preheat the oven to 400°F.",
    "With scissors or a sharp knife, cut off excess flaps of skin and fat from the thighs. Sprinkle with salt and pepper on both sides.",
    "Tear or cut the stalks from the chard leaves. Cut the stalks into 1-inch pieces. Slice the leaves into 2-inch-wide strips. Keep the stalks and leaves separate.",
    "In a large (12- to 13-inch) ovenproof skillet set over medium-high heat, add the oil. Once the oil shimmers, add the chicken with the skin side down. Cook on the skin side only for about 5 minutes without disturbing it, or until the skin lightly browns. Transfer to a plate. Add the potatoes and carrots to the skillet and cook for 5 minutes, or until they brown lightly.",
    "In a bowl or measuring cup, whisk the chicken stock, mustard, and lemon zest to combine.",
    "Add the chard stalks, smashed garlic and braising liquid to the skillet with the vegetables. Set the chicken pieces on top and sprinkle with the thyme.",
    "Transfer the pan to the oven. Roast, uncovered, for 30 minutes, or until the chicken is cooked through and the vegetables are tender. Remove the pan from the oven.",
    "Transfer the chicken thighs to a plate. Taste the broth and add more salt, if you like. Set the skillet over high heat and bring the liquid to a boil. Stir the chard leaves into the skillet and cook for 2 to 3 minutes, or just until wilted. Remove the garlic cloves.",
    "Set the chicken on top of the vegetables. Squeeze the lemon over the chicken and sprinkle with the parsley. Serve from the skillet, or transfer to a large serving platter."
  ],
  "category": null,
  "tags": ["dinner", "chicken", "one-pot", "skillet", "healthy", "comfort food"]
}
