{
  "name": "Slow Cooker Cuban Mojo Pork",
  "source": "House of Nash Eats",
  "source_file": "SLOW COOKER CUBAN MOJO PORK.txt",
  "author": "Amy Nash",
  "description": "Tender slow cooker Cuban Mojo Pork is full of garlic and citrus flavors. It's a simple dump-and-go recipe that marinates in a Cuban mojo sauce in the crock pot. And the leftovers make the best Cuban sandwiches ever!",
  "prep_time": "10 minutes",
  "cook_time": "6 hours",
  "total_time": "6 hours 10 minutes",
  "servings": "8",
  "ingredients": [
    "3-4 pound boneless pork shoulder or pork butt",
    "8 cloves garlic",
    "1/2 cup fresh orange juice",
    "1/2 cup fresh lime juice",
    "1/4 cup olive oil",
    "Zest of 1 orange",
    "Zest of 1 lime",
    "1 cup cilantro, finely chopped",
    "1/4 cup lightly packed mint leaves",
    "2 teaspoons dried oregano",
    "2 teaspoons ground cumin",
    "1 1/2 teaspoons kosher salt",
    "1 teaspoon freshly ground black pepper"
  ],
  "instructions": [
    "In a food processor or blender, combine all of the ingredients except for the pork shoulder and pulse until everything is finely chopped. If you do not have a food processor or blender, just finely chop the herbs and mince the garlic, then combine everything in a bowl and whisk together. Set aside about 1/3 cup of the mojo sauce for later and keep it in the fridge while the pork cooks.",
    "Place the pork shoulder in the slow cooker and pour the mojo sauce over it. Cover and cook on HIGH for 5-6 hours or on LOW for 8-10 hours.",
    "When the pork is fully cooked and tender, carefully transfer it to a baking sheet and bake in a 400 degree F oven for 15-20 minutes until browned on top. While doing this, you can thicken the cooking juices remaining in the slow cooker using a slurry made from 1 tablespoon of cornstarch mixed with 1 tablespoon of water, if desired. Just stir it in, cover, and cook on HIGH for 20-30 minutes while browning and shredding the pork.",
    "Pull the Cuban mojo pork apart using two forks or just by chopping with a large knife a few times to break it up into tender chunks. Drizzle with reserved mojo sauce, if desired, and serve with the remaining juices from the slow cooker."
  ],
  "category": null,
  "tags": ["dinner", "pork", "slow cooker", "cuban", "latin", "make-ahead"]
}
