{
  "name": "Slow-Cooker Korean Beef and Cabbage Stew",
  "source": "EatingWell",
  "source_file": "Slow-Cooker Korean Beef and Cabbage Stew.txt",
  "description": "Brown sugar makes this slow-cooker beef stew a tad sweet, which beautifully complements the spicy kimchi. You can make this soup ahead and refrigerate it until ready to eat.",
  "prep_time": "25 minutes",
  "total_time": "7 hours 35 minutes",
  "servings": "8",
  "ingredients": [
    "1 tablespoon canola oil",
    "1 (2 pound) boneless beef chuck roast, trimmed",
    "1/4 cup dry white wine",
    "3 tablespoons light brown sugar",
    "3 tablespoons lower-sodium soy sauce",
    "4 cups unsalted chicken stock",
    "1 yellow onion, halved",
    "2 tablespoons minced garlic (from 6 garlic cloves)",
    "1 jalapeno chile, seeded and chopped (about 2 tablespoons)",
    "4 cups chopped napa cabbage (about 14 ounces)",
    "3/4 teaspoon kosher salt",
    "1/2 teaspoon black pepper",
    "3/4 cup kimchi",
    "1/2 cup thinly sliced scallions (from 2 scallions)"
  ],
  "instructions": [
    "Heat the oil in a large nonstick skillet over medium-high. Add the beef to the skillet; cook, turning once, until well browned, about 10 minutes. Transfer the beef to a 5- to 6-quart slow cooker.",
    "Add the wine, brown sugar, and soy sauce to the skillet; bring to a boil over medium-high. Pour the wine mixture over the beef in the slow cooker. Stir the stock, onion halves, garlic, and jalapeno into the slow cooker; cover and cook on LOW until the beef is very tender, 7 to 8 hours.",
    "Using a slotted spoon, remove the onions from the slow cooker and discard; transfer the beef to a large bowl. Coarsely shred the beef using 2 forks; return the beef to the slow cooker. Stir in the cabbage, salt, and pepper. Cover and cook on LOW until the cabbage is wilted, about 10 minutes. Ladle the stew into bowls; top evenly with the kimchi and scallions."
  ],
  "notes": [
    "If you make ahead, wait until you reheat the soup to add the cabbage.",
    "Can also be made in a multicooker/Instant Pot."
  ],
  "category": null,
  "tags": ["dinner", "beef", "slow cooker", "korean", "stew", "asian", "comfort food"]
}
