{
  "name": "Smashed Potatoes (Garlic Parmesan)",
  "source_file": "Smashed Potatoes (Garlic Parmesan).txt",
  "author": "Lisa Bryan",
  "description": "Smashed potatoes are crispy on the outside, soft on the inside, and roasted with garlic parmesan goodness.",
  "prep_time": "15 minutes",
  "cook_time": "45 minutes",
  "total_time": "1 hour",
  "servings": "4",
  "ingredients": [
    "1 1/2 pounds small white potatoes",
    "1 1/2 tablespoons extra-virgin olive oil",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon freshly ground black pepper",
    "1/4 cup freshly grated parmesan cheese"
  ],
  "instructions": [
    "Boil the potatoes. Place the potatoes in a pot and fill it with enough water to cover the potatoes by an inch. Salt the water (I use about a tablespoon of kosher salt). Bring the pot to a boil over medium-high heat, then cook the potatoes until fork-tender, about 15 minutes.",
    "Drain and cool. Drain the potatoes in a colander and let them cool to the touch, about 10 minutes.",
    "Season and flavor. Preheat the oven to 450°F (230°C). Transfer the potatoes to a mixing bowl, then add the oil, garlic powder, salt, and pepper. Stir to fully coat the potatoes in the seasoning.",
    "Smash the potatoes. Place the potatoes on a baking sheet and use the bottom of a glass to smash them down. Thinner potatoes are more crispy, though are also more likely to break apart. Aim for a height of about 1/2-inch. Bake until the potatoes are golden and turning crispy, about 25 to 30 minutes.",
    "Add parmesan cheese. Sprinkle the parmesan cheese evenly over the top and bake 5 minutes more.",
    "If you'd like, sprinkle with chopped parsley before serving, then serve them up warm!"
  ],
  "notes": [
    "I recommend finding really small potatoes or baby potatoes. They're easier to smash and more likely to crisp up!",
    "To make this recipe dairy-free, just omit the cheese. You can also add a sprinkle of nutritional yeast if you'd like, for a nod to that cheesy flavor."
  ],
  "category": null,
  "tags": ["side dish", "potatoes", "vegetarian", "american", "crispy"]
}
