{
  "name": "Spiced Lentils with Carrots",
  "source": "Budget Bytes",
  "source_file": "Spiced Lentils with Carrots.txt",
  "author": "Beth",
  "description": "These warm, sweet, and savory spiced lentils hold up well as leftovers and make the perfect cozy vegetarian meal prep.",
  "prep_time": "10 minutes",
  "cook_time": "40 minutes",
  "total_time": "50 minutes",
  "servings": "4 (about 1.25 cups each)",
  "ingredients": [
    "1 yellow onion",
    "4 cloves garlic",
    "1 tsp fresh grated ginger",
    "4 carrots (about 2 cups chopped)",
    "2 tablespoons olive oil",
    "1 tsp ground cumin",
    "1/2 tsp cinnamon",
    "1/2 tsp allspice",
    "1/4 tsp crushed red pepper",
    "1 cup brown lentils",
    "3 tablespoons tomato paste",
    "1/4 cup chopped dried apricots or raisins",
    "3 cups vegetable broth",
    "1 tablespoon chopped parsley (optional)"
  ],
  "instructions": [
    "Dice the onion, mince the garlic, grate the ginger, and peel and dice the carrots.",
    "Add the onion, garlic, ginger, and olive oil to a deep skillet. Saute over medium heat until the onions are soft and translucent (about five minutes).",
    "Add the diced carrots, cumin, cinnamon, allspice, and crushed red pepper to the skillet. Continue to saute for about two minutes more.",
    "Next, add the uncooked lentils, tomato paste, raisins or chopped apricots, and broth to the skillet. Stir until the tomato paste has dissolved into the broth. Place a lid on the skillet and turn the heat up to high.",
    "Allow the broth to come to a full boil. Once boiling, turn the heat down to medium-low and let the lentils simmer in the broth with the lid on for 30 minutes, stirring only occasionally.",
    "After 30 minutes the lentils and carrots should be very tender. Give the lentils a taste and add salt or pepper if needed.",
    "Serve the spiced lentils with crusty bread for dipping, or over a bed of polenta or mashed potatoes. Top with chopped fresh parsley if desired."
  ],
  "category": null,
  "tags": ["dinner", "lentils", "vegetarian", "vegan", "moroccan", "healthy", "budget", "meal prep"]
}
