{
  "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
  "source": "Allrecipes",
  "source_file": "Spicy Thai Basil Chicken (Pad Krapow Gai) Recipe Allrecipes.txt",
  "description": "This classic Thai dish has spectacular taste even with regular basil instead of Thai or holy basil. The sauce actually acts like a glaze as the chicken mixture cooks over high heat. The recipe works best if you chop or grind your own chicken and have all ingredients prepped before you start cooking.",
  "prep_time": "15 minutes",
  "cook_time": "10 minutes",
  "total_time": "25 minutes",
  "servings": "2",
  "ingredients": [
    "1/2 cup chicken broth",
    "1 tablespoon oyster sauce",
    "1 tablespoon soy sauce, or as needed",
    "2 teaspoons fish sauce",
    "1 teaspoon white sugar",
    "1 teaspoon brown sugar",
    "2 tablespoons vegetable oil",
    "1 pound skinless, boneless chicken thighs, coarsely chopped",
    "1/4 cup sliced shallots",
    "4 cloves garlic, minced",
    "2 tablespoons minced Thai chilies, Serrano, or other hot pepper",
    "1 cup very thinly sliced fresh basil leaves",
    "2 cups hot cooked rice"
  ],
  "instructions": [
    "Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended.",
    "Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute.",
    "Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat.",
    "Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice."
  ],
  "notes": [
    "Makes 2 large or 4 small portions.",
    "To slice basil leaves, stack about 5 of them and roll tightly like a cigar. Then slice into thin ribbons. Make a couple of cuts in the opposite direction for smaller pieces that cook faster."
  ],
  "nutrition": {
    "calories": "715",
    "protein": "49.8g",
    "carbohydrates": "58.6g",
    "fat": "30g",
    "cholesterol": "155.9mg",
    "sodium": "1181.9mg"
  },
  "category": null,
  "tags": ["dinner", "chicken", "thai", "asian", "stir-fry", "spicy", "quick"]
}
