{
  "name": "Tacos Al Pastor (Grilled Pork)",
  "source_file": "TACOS AL PASTOR (GRILLED PORK).txt",
  "description": "Traditional Mexican tacos al pastor with pork marinated in a dried chile sauce with annatto, citrus, and spices, then grilled and served with pineapple, onion, and cilantro.",
  "total_time": "1 hour 15 minutes",
  "servings": "12 tacos",
  "ingredients": [
    "4 dried guajillo chiles (about 1 oz)",
    "1 dried ancho chile",
    "2 dried chipotle chiles",
    "2 tablespoons fresh orange juice",
    "1/2 tablespoon fresh lime juice",
    "1/4 cup Coca Cola",
    "3 tablespoons cider vinegar",
    "1 teaspoon annatto seeds",
    "1/2 teaspoon dried oregano",
    "1/4 teaspoon cumin seeds",
    "1 whole clove",
    "1/2 tablespoon brown sugar",
    "1/4 teaspoon garlic powder",
    "2 tablespoons vegetable oil",
    "2 1/2 lb boneless pork shoulder",
    "1 large Spanish onion, cut into 1/2-inch slices",
    "Salt and fresh ground pepper",
    "12 corn tortillas, warmed",
    "1/2 grilled pineapple, chopped, for serving",
    "Red onion and cilantro for serving"
  ],
  "instructions": [
    "Stem and seed all dried chiles and place in microwave-safe bowl. Cover with water and microwave at high until softened, about 3 minutes. Let cool slightly, drain and transfer to blender. Add orange juice, lime juice, soda and vinegar. In spice grinder, grind annatto with oregano, cumin, clove, sugar and garlic powder until fine. Add spice mixture to blender and blend until smooth.",
    "Transfer marinade to saucepan. Add 2 tablespoons oil and cook over moderate heat until very thick (5 minutes). Let cool. Transfer marinade to large resealable bag and marinate pork and onion in refrigerator overnight.",
    "Scrape off most of marinade. Brush pork and onion with oil and season with salt and pepper. Grill about 15 minutes. Cover with loose foil on work station about 10 minutes.",
    "Cut pork into strips. Serve pork and onion with warmed tortillas, grilled pineapple, red onion and cilantro."
  ],
  "category": "Steve's Signatures",
  "tags": ["dinner", "pork", "mexican", "tacos", "grilled", "spicy"]
}
