{
  "name": "Vegan Mushroom Stew",
  "source_file": "VEGAN MUSHROOM STEW.txt",
  "author": "Kylie",
  "description": "Colder weather calls for hearty meals, and this easy one pot vegetable stew is perfect for an easy dinner that everyone will love! It comes together in about 45 minutes and is loaded with root vegetables and lentils which make this vegetarian stew super filling!",
  "prep_time": "10 minutes",
  "cook_time": "35 minutes",
  "total_time": "45 minutes",
  "servings": "6",
  "ingredients": [
    "3 tablespoons olive oil",
    "1 yellow onion, diced",
    "1 cup sliced carrot",
    "1 cup sliced celery",
    "16 oz baby Bella mushrooms, halved",
    "6 cloves garlic, thinly sliced",
    "2 teaspoons dried thyme",
    "1 teaspoon dried oregano",
    "1/2 teaspoon dried sage",
    "2 tablespoons flour",
    "1/4 cup balsamic vinegar",
    "2 tablespoons soy sauce",
    "16 oz baby yellow potatoes, halved",
    "1 cup uncooked split red lentils",
    "1 (14.5 oz) can tomato sauce",
    "3 cups vegetable broth",
    "2 bay leaves",
    "Kosher salt",
    "Fresh cracked pepper"
  ],
  "instructions": [
    "Heat oil in a large pot over medium heat.",
    "Add onion, carrot, and celery along with a couple pinches of salt and pepper.",
    "Cook, stirring occasionally for 8 minutes.",
    "Add mushrooms, garlic, thyme, oregano, sage, and a couple pinches of salt and pepper.",
    "Cook, stirring frequently, for 3-4 minutes.",
    "Add flour and stir to evenly coat everything. Cook, stirring frequently for 1 minute.",
    "Stir in balsamic vinegar and soy sauce to deglaze the pan, scraping the yummy bits off the bottom.",
    "Add potatoes, lentils, tomato sauce, broth, and bay leaves, along with a couple pinches of salt and pepper.",
    "Bring to a simmer over medium-high heat, stirring occasionally so that the lentils don't stick to the pan.",
    "Turn heat to low and simmer gently for 10-15 minutes or until the potatoes are fork-tender. Season to taste with salt and pepper.",
    "Garnish with fresh parsley, serve with mashed potatoes, and enjoy!"
  ],
  "notes": [
    "Salt is very important in this recipe! Salt helps the potatoes break down and cook properly in the acidic stew base with tomato sauce, balsamic vinegar, and soy sauce.",
    "Feel free to switch up the veggies for your favorites."
  ],
  "category": null,
  "tags": ["dinner", "stew", "vegan", "vegetarian", "mushrooms", "lentils", "one-pot", "comfort food", "fall", "winter"]
}
